# 1. Importing libraries

In [1]:
import pandas as pd
import numpy as np
import os

# 2. Importing data

In [2]:
#create path
path = r'C:\Users\Mathilde\Documents\DATA ANALYSIS CAREERFOUNDRY\May 2024 - Instacart Basket Analysis'
#orders product combined data
df_ords_prods = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared data', 'orders_products_combined.pkl'))

In [3]:
#products data
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Prepared data', 'products_checked.csv'), index_col = False)

In [5]:
#checking the new import
df_ords_prods.shape

(32434489, 10)

# 3. Combining orders product prior dataframe w/ products data frame

In [4]:
#Visualize the dataframes to help
df_ords_prods.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [5]:
#Need to drop the column "_merge" because it's giving me an error when trying to merge with indicator in the next step
df_ords_prods=df_ords_prods.drop(columns = ['_merge'])

In [6]:
#checking if column was removed
df_ords_prods.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,196,1,0
1,2539329,1,1,2,8,NaN,14084,2,0
2,2539329,1,1,2,8,NaN,12427,3,0
3,2539329,1,1,2,8,NaN,26088,4,0
4,2539329,1,1,2,8,NaN,26405,5,0

In [8]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

### Reflexion on the combination:

The two dataframes are not the same shape, they can't be concatenated.

The two dataframes have one column in common: product_id. It will be our key for merging

We're using an inner join in order to only get products that appear in both data sets.

In [7]:
df_merged = df_ords_prods.merge(df_prods, on='product_id', how='inner', indicator=True)

In [8]:
#merge flag
df_merged['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [9]:
#dropping the "_merge" column because I won't need it anymore - sparing a bit of memory
df_merged=df_merged.drop(columns = ['_merge'])

### Observation:

The only value in "merge" column is "both" - which is to be expexted as we used an inner join. We got rid of the 2029 unwanted lines that we got with the left join, from the 2 products that were not referenced in the prods data set.

# 4. Export new data frame

In [10]:
#export as pickle, as new data set is very large, csv would be to slow to export and read
df_merged.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'ords_prods_merge.pkl'))